БухЭксп/DataProcessors/CW_ПодборОперативныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>CW_ПодборОперативныхДокументов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_ОперативнаяДебиторскаяЗадолженность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_ОперативнаяДебиторскаяЗадолженность</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего_Валюта</Name>
					<Comment>"Всего" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>"Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыДвиженийПоОперативнойЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_КорректировкаОперативнойЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДвижениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РеализацияПрочихТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_ОперативнаяКредиторскаяЗадолженность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_ОперативнаяКредиторскаяЗадолженность</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего_Валюта</Name>
					<Comment>"Всего" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>"Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыДвиженийПоОперативнойЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_КорректировкаОперативнойЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоПриобретениям</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДвижениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ОплатаИсходящихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ОплатаИсходящихДокументов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПризнакАкта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РеализацияПрочихТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетЗадолженности</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументБУ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ОплатаВходящихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ОплатаВходящихДокументов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПризнакАкта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоПриобретениям</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетЗадолженности</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументБУ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоПриобретениям</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Documents/CW_Оплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_Оплата</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CW_КурсовыеРазницы</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяКредиторскаяЗадолженность</xr:Item>
				<xr:Item>AccumulationRegister.CW_ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяДебиторскаяЗадолженность</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОплатаИсходящихСчетов</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОплатаВходящихСчетов</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОплатыПокупателейУСН</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаВходящихДокументов</xr:Item>
				<xr:Item>InformationRegister.CW_РаспределениеОплатПокупателейУСН</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаИсходящихДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыОперативнойЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийПодборСчетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийПодборАктов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеДерева</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОтраженияАванса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокОтраженияАвансов</v8:Type>
						<v8:Type>cfg:CatalogRef.Патенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Акт</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗадолженности</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАванса</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оплата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оплата_БВ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Comment>НДС (в валюте оплаты)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/DataProcessors/CW_ПодборОперативныхДокументов/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_Документы.ОпределитьВозможностьОткрытияОбъектаМодуля(ТипЗнч(ДокументВыписки),,Отказ);
	
	Параметры.Свойство("Ссылка",				ДокументВыписки);  
	Параметры.Свойство("ДатаДокумента", 		ДатаДокумента);
	Параметры.Свойство("Организация", 			Организация);
	Параметры.Свойство("Контрагент", 			Контрагент);
	Параметры.Свойство("Договор",				Договор);        
	Параметры.Свойство("ПриложениеКДоговору",	ПриложениеКДоговору);        
	Параметры.Свойство("УчетныйДоговор",		УчетныйДоговор);  
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить(); 

	ВалютаДоговора = Договор.ВалютаДоговора;
	УстановитьВидимостьСуммыВВалюте(); 
	
	УстановитьДеревоНаФорме();     
	
	//Подсистема.УчетПриложенийДоговоров
	ДанныеОбъекта = Новый Структура("Договор", Договор);
	CW_УчетПриложенийДоговоровСервер.УстановитьПараметрФункциональнойОпции(ЭтаФорма, ДанныеОбъекта);
	//Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры   

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭлементыДерева = ДеревоЗначений.ПолучитьЭлементы(); 

	МассивСтрок = Новый Массив;
	Для Каждого СтрокаДерева из ЭлементыДерева ЦИкл
		МассивСтрок.Добавить(СтрокаДерева.ПолучитьИдентификатор());
	КонецЦикла; 
	
	ПересчитатьИтоги();	
	РазвернутьДерево(МассивСтрок);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДеревоНаФорме()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СвязанныеОплаты.Ссылка КАК Ссылка
	               |ИЗ
	               |	КритерийОтбора.CW_СвязанныеОплаты(&Ссылка) КАК CW_СвязанныеОплаты
	               |ГДЕ
	               |	CW_СвязанныеОплаты.Ссылка.Организация = &Организация
	               |	И CW_СвязанныеОплаты.Ссылка.Контрагент = &Контрагент
	               |	И CW_СвязанныеОплаты.Ссылка.Договор = &Договор
	               |	И CW_СвязанныеОплаты.Ссылка.ПриложениеКДоговору = &ПриложениеКДоговору"; 
	
	Запрос.УстановитьПараметр("Ссылка", 		ДокументВыписки);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Контрагент", 	Контрагент);
	Запрос.УстановитьПараметр("Договор", 		Договор);
	Запрос.УстановитьПараметр("ПриложениеКДоговору", ПриложениеКДоговору);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда 
		ОплатаСсылка = Выборка.Ссылка;  
		
		СтатьяДвиженияДенежныхСредств = ОплатаСсылка.СтатьяДвиженияДенежныхСредств; 
		
		ДеревоОплат = ОплатаСсылка.ХранилищеДерева.Получить();
		Если ТипЗнч(ДеревоОплат) = Тип("ДеревоЗначений") Тогда
			Попытка
				ЗначениеВРеквизитФормы(ДеревоОплат, "ДеревоЗначений");
			Исключение 
				//На случай, если изменится структура дерева
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ДоговорПриИзмененииНаСервере(); 
	
КонецПроцедуры   

&НаКлиенте
Процедура ПриложениеКДоговоруПриИзменении(Элемент)
	ПриложениеКДоговоруПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере() 

	
	УчетныйДоговор = Договор.УчетныйДоговор;
 	ВалютаДоговора = Договор.ВалютаДоговора;

	УстановитьВидимостьСуммыВВалюте();  

	//Подсистема.УчетПриложенийДоговоров
	ДанныеОбъекта = Новый Структура("Договор", Договор);
	CW_УчетПриложенийДоговоровСервер.УстановитьПараметрФункциональнойОпции(ЭтаФорма, ДанныеОбъекта);
	//Подсистема.УчетПриложенийДоговоров  
	
КонецПроцедуры 

&НаСервере
Процедура ПриложениеКДоговоруПриИзмененииНаСервере()

	УчетныйДоговор = ПриложениеКДоговору.УчетныйДоговор;
 	ВалютаДоговора = ПриложениеКДоговору.ВалютаДоговора;  
	
	УстановитьВидимостьСуммыВВалюте(); 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСуммыВВалюте()
	
	Элементы.ДеревоЗначенийСуммаВал.Видимость 	= ВалютаРегламентированногоУчета <> ВалютаДоговора;
	Элементы.ДеревоЗначенийКурс.Видимость 		= ВалютаРегламентированногоУчета <> ВалютаДоговора;
	Элементы.ДеревоЗначенийСуммаВал.Заголовок 	= "Сумма, "+СокрЛП(ВалютаДоговора);
	
КонецПроцедуры


//Очистка дерева счетов
&НаКлиенте
Процедура Очистить(Команда)   
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, "Табличная часть будет очищена. Продолжить?", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;  
	
	ОчиститьНаСервере();	
	ПересчитатьИтоги();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере()
	
	ЭлементыДерева = ДеревоЗначений.ПолучитьЭлементы();
	ЭлементыДерева.Очистить();

КонецПроцедуры
//---Очистка дерева счетов


//Подбор документов
&НаКлиенте
Процедура Подбор(Команда)

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыборТипаДокумента", ЭтотОбъект);
	
	МассивОграничениеТипа = ПолучитьОграниченияТипа();
	
	СписокТиповДокумента = Новый СписокЗначений;
	СписокТиповДокумента.ЗагрузитьЗначения(МассивОграничениеТипа);
	СписокТиповДокумента.ПоказатьВыборЭлемента(ОписаниеОповещения, "Выберите тип документа");
	
КонецПроцедуры    

&НаКлиенте
Процедура ЗавершитьВыборТипаДокумента(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;          
	
	ТипОбъекта = РезультатВыбора.Значение;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТипОбъекта", ТипОбъекта);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборДокументов", ЭтотОбъект, ДополнительныеПараметры);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация",		Организация);
	Отбор.Вставить("Контрагент", 		Контрагент);
	Отбор.Вставить("Договор",			Договор);
	Отбор.Вставить("Проведен",			Истина); 
	
	Если ТипОбъекта = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		Отбор.Вставить("ФормируетсяСчет", Истина);                                       
	КонецЕсли;
	Если ТипОбъекта = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		Отбор.Вставить("ПредъявленСчет", Истина);                                       
	КонецЕсли;
	Если ТипОбъекта = Тип("ДокументСсылка.CW_Оплата") Тогда
		Отбор.Вставить("ЭтоВозврат", Ложь);                                       
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПриложениеКДоговору) Тогда
		Отбор.Вставить("ПриложениеКДоговору", 	ПриложениеКДоговору);
	КонецЕсли; 
	
	СтруктураПараметров = Новый Структура;    
	СтруктураПараметров.Вставить("РежимВыбора", 		Истина);
	СтруктураПараметров.Вставить("МножественныйВыбор", 	Ложь);
	СтруктураПараметров.Вставить("Отбор", 				Отбор);
	
	ИмяОбъекта = ПолучитьИмяОбъектаПоТипуНаСервере(ТипОбъекта);  
	ОткрытьФорму("Документ."+ИмяОбъекта+".ФормаВыбора",СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры         

&НаСервере
Функция ПолучитьИмяОбъектаПоТипуНаСервере(Знач Тип)
	
	ПолноеИмя  = Метаданные.НайтиПоТипу(Тип).ПолноеИмя();
	ИмяОбъекта = СтрРазделить(ПолноеИмя, ".")[1];
	
	Возврат ИмяОбъекта;
	
КонецФункции  

&НаСервере
Функция ПолучитьОграниченияТипа()
	
	ОграничениеТипа = Новый Массив; 
	Если ТипЗнч(ДокументВыписки) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") Тогда
		ОграничениеТипа.Добавить(Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке"));  
	КонецЕсли;
	
	Если ТипЗнч(ДокументВыписки) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
		ОграничениеТипа.Добавить(Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке"));  
	КонецЕсли;
	
	ОграничениеТипа.Добавить(Тип("ДокументСсылка.CW_Оплата"));
	
	Возврат ОграничениеТипа;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьВыборДокументов(РезультатВыбора, ДополнительныеПараметры) Экспорт
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	МассивДобавленныхСтрок = ОбработатьВыборДокументовНаСервере(РезультатВыбора, ДополнительныеПараметры);
	
	РазвернутьДерево(МассивДобавленныхСтрок);
   	ПересчитатьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево(МассивДобавленныхСтрок)
	
	Для Каждого СтрокаДерева из МассивДобавленныхСтрок Цикл
		Элементы.ДеревоЗначений.Развернуть(СтрокаДерева, Истина);          
	КонецЦикла;

КонецПроцедуры  

&НаСервере
Функция ОбработатьВыборДокументовНаСервере(РезультатВыбора, ДополнительныеПараметры) 

	МассивДобавленныхСтрок = Новый Массив;
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат МассивДобавленныхСтрок;
	КонецЕсли;  
	
	ДеревоФормы 	= РеквизитФормыВЗначение("ДеревоЗначений");
	ЭлементыДерева 	= ДеревоЗначений.ПолучитьЭлементы();  
	ДеревоСчетов 	= ПодготовитьДеревоДляЗаполнения(РезультатВыбора, ДополнительныеПараметры);  
	
	Для Каждого СтрокаДерва из ДеревоСчетов.Строки Цикл 
		
		Отбор = Новый Структура("ДокументВзаиморасчетов", СтрокаДерва.ДокументВзаиморасчетов);
		НайденныеСтроки = ДеревоФормы.Строки.НайтиСтроки(Отбор, Ложь);  
		Если НайденныеСтроки.Количество() > 0 Тогда 
			//Этот счет уже есть в списке, пока пропускаем всю ветку
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаДерева = ЭлементыДерева.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДерева, СтрокаДерва);  
		
		МассивДобавленныхСтрок.Добавить(НоваяСтрокаДерева.ПолучитьИдентификатор());
		
		Если СтрокаДерва.Строки.Количество() > 0 Тогда
			//Тут просто добавляем	
			СписокПодчиненныхЭлементов = НоваяСтрокаДерева.ПолучитьЭлементы(); 
			Для Каждого СтрокаВторогоУровня из СтрокаДерва.Строки Цикл
				ПодчиненнаяСтрока = СписокПодчиненныхЭлементов.Добавить();
				ЗаполнитьЗначенияСвойств(ПодчиненнаяСтрока, СтрокаВторогоУровня);     
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивДобавленныхСтрок;
	
КонецФункции  

&НаСервере
Функция ПодготовитьДеревоДляЗаполнения(РезультатВыбора, ДополнительныеПараметры) 
	
	ДатаСреза 		= ?(ЗначениеЗаполнено(ДатаДокумента), ДатаДокумента, ТекущаяДата());  
	КурсВалюты 		= CW_Финансы.ПолучитьКурсВалюты(ВалютаРегламентированногоУчета, ДатаСреза);
	ДеревоСчетов 	= ПолучитьПустоеДерево();
	
	Если ДополнительныеПараметры.ТипОбъекта = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда 
		ПодготовитьДеревоОплатПоДоходамПоГрузоперевозке(РезультатВыбора, ДеревоСчетов, КурсВалюты, ДатаСреза);
	КонецЕсли;
	
	Если ДополнительныеПараметры.ТипОбъекта = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда 
		ПодготовитьДеревоОплатПоРасходамПоГрузоперевозке(РезультатВыбора, ДеревоСчетов, КурсВалюты, ДатаСреза);
	КонецЕсли;
	
	Если ДополнительныеПараметры.ТипОбъекта = Тип("ДокументСсылка.CW_Оплата") Тогда
		ПодготовитьДеревоПоОплате(РезультатВыбора, ДеревоСчетов);
	КонецЕсли;
	
	Возврат ДеревоСчетов;
	
КонецФункции

&НаСервере
Процедура ПодготовитьДеревоПоОплате(Знач РезультатВыбора,  ДеревоСчетов)
	
	Запрос = Новый Запрос;  
	
	Если ТипЗнч(ДокументВыписки) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") Тогда
		ЗапросТекст = "ВЫБРАТЬ
		|	CW_ОперативнаяДебиторскаяЗадолженностьОбороты.Счет КАК Счет,
		|	CW_ОперативнаяДебиторскаяЗадолженностьОбороты.СчетУчета КАК СчетУчета,
		|	CW_ОперативнаяДебиторскаяЗадолженностьОбороты.Счет.Основание КАК СчетОснование,
		|	CW_ОперативнаяДебиторскаяЗадолженностьОбороты.Всего_ВалютаРасход КАК ВсегоВалюта,
		|	CW_ОперативнаяДебиторскаяЗадолженностьОбороты.ВсегоРасход КАК Всего
		|ИЗ
		|	РегистрНакопления.CW_ОперативнаяДебиторскаяЗадолженность.Обороты(, , Период, Счет В (&РезультатВыбора)) КАК CW_ОперативнаяДебиторскаяЗадолженностьОбороты";
	КонецЕсли; 
	
	Если ТипЗнч(ДокументВыписки) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
		ЗапросТекст = "ВЫБРАТЬ
		|	CW_ОперативнаяКредиторскаяЗадолженностьОбороты.Счет КАК Счет,
		|	CW_ОперативнаяКредиторскаяЗадолженностьОбороты.СчетУчета КАК СчетУчета,
		|	CW_ОперативнаяКредиторскаяЗадолженностьОбороты.Счет.Основание КАК СчетОснование,
		|	CW_ОперативнаяКредиторскаяЗадолженностьОбороты.Всего_ВалютаРасход КАК ВсегоВалюта,
		|	CW_ОперативнаяКредиторскаяЗадолженностьОбороты.ВсегоРасход КАК Всего
		|ИЗ
		|	РегистрНакопления.CW_ОперативнаяКредиторскаяЗадолженность.Обороты(, , Период, Счет В (&РезультатВыбора)) КАК CW_ОперативнаяКредиторскаяЗадолженностьОбороты";
	КонецЕсли;  
	
	Если ЗапросТекст = Неопределено Тогда
		ВызватьИсключение "Не удалось опредеить вид оперативной задолженности!";
	КонецЕсли;
	
	Запрос.Текст = ЗапросТекст;

	Запрос.УстановитьПараметр("РезультатВыбора", РезультатВыбора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ПредставлениеДокумента", Выборка.Счет.Метаданные()) Тогда
			ПредставлениеДокумента = Выборка.Счет.ПредставлениеДокумента;
		Иначе
			ПредставлениеДокумента = СокрЛП(Выборка.Счет);
		КонецЕсли;
		
		НоваяСтрокаСчет = ДеревоСчетов.Строки.Добавить();
		НоваяСтрокаСчет.ДокументВзаиморасчетов 	= Выборка.Счет;
		НоваяСтрокаСчет.ПредставлениеДокумента 	= ПредставлениеДокумента;
		НоваяСтрокаСчет.СчетЗадолженности      	= Выборка.СчетУчета;
		НоваяСтрокаСчет.СуммаВал               	= Выборка.ВсегоВалюта;
		//НоваяСтрокаСчет.Сделка                = ВыборкаСчет.Документ.ВедомыйСчет;
		//НоваяСтрокаСчет.СтавкаНДС    			= Неопределено;
		НоваяСтрокаСчет.Сумма 					= Выборка.Всего; 
		
		НоваяСтрокаСчет.Курс = 1;
		Если НоваяСтрокаСчет.СуммаВал <> 0 Тогда
			НоваяСтрокаСчет.Курс = НоваяСтрокаСчет.Сумма / НоваяСтрокаСчет.СуммаВал;
		КонецЕсли;
		
		СтрокаВторогоУровня = НоваяСтрокаСчет.Строки.Добавить();
		СтрокаВторогоУровня.ИндексКартинки 			= 1;
		СтрокаВторогоУровня.ДокументВзаиморасчетов 	= Выборка.Счет;
		СтрокаВторогоУровня.ПредставлениеДокумента 	= ПредставлениеДокумента;
		СтрокаВторогоУровня.СчетЗадолженности      	= Выборка.СчетУчета;
		СтрокаВторогоУровня.СуммаВал               	= Выборка.ВсегоВалюта;
		СтрокаВторогоУровня.Сделка                  = Выборка.СчетОснование;
		//СтрокаВторогоУровня.СтавкаНДС    			= Неопределено;
		СтрокаВторогоУровня.Сумма 					= Выборка.Всего; 
		
		СтрокаВторогоУровня.Курс = 1;
		Если СтрокаВторогоУровня.СуммаВал <> 0 Тогда
			СтрокаВторогоУровня.Курс = СтрокаВторогоУровня.Сумма / СтрокаВторогоУровня.СуммаВал;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПодготовитьДеревоОплатПоДоходамПоГрузоперевозке(Знач РезультатВыбора, ДеревоСчетов, Знач КурсВалюты, Знач ДатаСреза)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ОплатаИсходящихДокументов.Документ КАК Документ,
	|	CW_ОплатаИсходящихДокументов.ДокументБУ КАК ДокументБУ,
	|	CW_ОплатаИсходящихДокументов.ДокументОплаты КАК ДокументОплаты,
	|	CW_ОплатаИсходящихДокументов.СчетЗадолженности КАК СчетЗадолженности,
	|	CW_ОплатаИсходящихДокументов.Всего КАК Всего,
	|	CW_ОплатаИсходящихДокументов.ПризнакАкта КАК ПризнакАкта
	|ПОМЕСТИТЬ ВТ_ДанныеРегистра
	|ИЗ
	|	РегистрСведений.CW_ОплатаИсходящихДокументов КАК CW_ОплатаИсходящихДокументов
	|ГДЕ
	|	CW_ОплатаИсходящихДокументов.Документ В(&РезультатВыбора)
	|	И CW_ОплатаИсходящихДокументов.Регистратор <> &ОплатаСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеРегистра.Документ КАК Документ,
	|	ВТ_ДанныеРегистра.ДокументБУ КАК ДокументБУ,
	|	ВТ_ДанныеРегистра.ДокументОплаты КАК ДокументОплаты,
	|	ВТ_ДанныеРегистра.СчетЗадолженности КАК СчетЗадолженности,
	|	ВТ_ДанныеРегистра.Всего КАК Всего
	|ПОМЕСТИТЬ ВТ_Акты
	|ИЗ
	|	ВТ_ДанныеРегистра КАК ВТ_ДанныеРегистра
	|ГДЕ
	|	ВТ_ДанныеРегистра.ПризнакАкта = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Акты.Документ КАК Документ,
	|	ВТ_Акты.ДокументБУ КАК ДокументБУ,
	|	ВТ_Акты.ДокументОплаты КАК ДокументОплаты,
	|	ВТ_Акты.СчетЗадолженности КАК СчетЗадолженности,
	|	ВТ_Акты.Всего КАК Всего
	|ИЗ
	|	ВТ_Акты КАК ВТ_Акты
	|ИТОГИ
	|	СУММА(Всего)
	|ПО
	|	Документ,
	|	СчетЗадолженности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеРегистра.Документ КАК Документ,
	|	ВТ_ДанныеРегистра.ДокументОплаты КАК ДокументБУ,
	|	ВТ_ДанныеРегистра.СчетЗадолженности КАК СчетЗадолженности,
	|	ВТ_ДанныеРегистра.Всего КАК Всего
	|ИЗ
	|	ВТ_ДанныеРегистра КАК ВТ_ДанныеРегистра
	|ГДЕ
	|	ВТ_ДанныеРегистра.ПризнакАкта = ЛОЖЬ
	|	И ВТ_ДанныеРегистра.ДокументОплаты ССЫЛКА Документ.CW_Оплата
	|	И НЕ ВТ_ДанныеРегистра.Документ В
	|				(ВЫБРАТЬ
	|					ВТ_Акты.Документ КАК Документ
	|				ИЗ
	|					ВТ_Акты КАК ВТ_Акты)";
	
	Запрос.УстановитьПараметр("РезультатВыбора", РезультатВыбора);
	Запрос.УстановитьПараметр("ОплатаСсылка", 	 ОплатаСсылка); 
	
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();  
	
	РезультатЗапроса 		= ПакетРезультатовЗапроса[2];
	
	ВыборкаСчетЗадолженности = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСчетЗадолженности.Следующий() Цикл 
		
		ВыборкаСчет = ВыборкаСчетЗадолженности.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСчет.Следующий() Цикл     
			
			ВалютаСчета		= ВыборкаСчет.Документ.Валюта;
			КурсВалютыСчета	= CW_Финансы.ПолучитьКурсВалюты(ВалютаСчета, ДатаСреза); 
			
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ПредставлениеДокумента", ВыборкаСчет.Документ.Метаданные()) Тогда
				ПредставлениеДокумента = ВыборкаСчет.Документ.ПредставлениеДокумента;
			Иначе
				ПредставлениеДокумента = СокрЛП(ВыборкаСчет.Документ);
			КонецЕсли;
			
			НоваяСтрокаСчет = ДеревоСчетов.Строки.Добавить();
			НоваяСтрокаСчет.ДокументВзаиморасчетов 	= ВыборкаСчет.Документ;
			НоваяСтрокаСчет.ПредставлениеДокумента 	= ПредставлениеДокумента;
			НоваяСтрокаСчет.СчетЗадолженности      	= ВыборкаСчет.СчетЗадолженности;
			НоваяСтрокаСчет.СуммаВал               	= ВыборкаСчет.Всего;
			//НоваяСтрокаСчет.Сделка                = ВыборкаСчет.Документ.ВедомыйСчет;
			//НоваяСтрокаСчет.СтавкаНДС    			= Неопределено;
			НоваяСтрокаСчет.Сумма 					= CW_Финансы.ПересчитатьИзВалютыВВалюту(
														ВыборкаСчет.Всего, 
														ВалютаСчета, 
														ВалютаРегламентированногоУчета, 
														КурсВалютыСчета.Курс, 
														КурсВалюты.Курс, 
														КурсВалютыСчета.Кратность, 
														КурсВалюты.Кратность);  
			
			НоваяСтрокаСчет.Курс = 1;
			Если НоваяСтрокаСчет.СуммаВал <> 0 Тогда
				НоваяСтрокаСчет.Курс = НоваяСтрокаСчет.Сумма / НоваяСтрокаСчет.СуммаВал;
			КонецЕсли;
			
			ВыборкаАкт = ВыборкаСчет.Выбрать();
			Пока ВыборкаАкт.Следующий() Цикл  
				
				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ПредставлениеДокумента", ВыборкаАкт.ДокументБУ.Метаданные()) Тогда
					ПредставлениеДокумента = ВыборкаАкт.ДокументБУ.ПредставлениеДокумента;
				Иначе
					ПредставлениеДокумента = СокрЛП(ВыборкаАкт.ДокументБУ);
				КонецЕсли;
				
				СтрокаВторогоУровня = НоваяСтрокаСчет.Строки.Добавить();
				СтрокаВторогоУровня.ИндексКартинки 			= 1;
				СтрокаВторогоУровня.ПредставлениеДокумента 	= ПредставлениеДокумента;
				СтрокаВторогоУровня.ДокументВзаиморасчетов 	= ВыборкаАкт.ДокументБУ;
				СтрокаВторогоУровня.СчетЗадолженности      	= ВыборкаАкт.СчетЗадолженности;
				СтрокаВторогоУровня.СуммаВал               	= ВыборкаАкт.Всего;
				СтрокаВторогоУровня.Сделка                 	= ВыборкаАкт.ДокументБУ.ВедомыйДокумент;
				//СтрокаВторогоУровня.СтавкаНДС    			= Неопределено;
				СтрокаВторогоУровня.Сумма = CW_Финансы.ПересчитатьИзВалютыВВалюту(
												ВыборкаАкт.Всего, 
												ВалютаСчета, 
												ВалютаРегламентированногоУчета, 
												КурсВалютыСчета.Курс, 
												КурсВалюты.Курс, 
												КурсВалютыСчета.Кратность, 
												КурсВалюты.Кратность);    
				
				СтрокаВторогоУровня.Курс = 1;
				Если СтрокаВторогоУровня.СуммаВал <> 0 Тогда
					СтрокаВторогоУровня.Курс = СтрокаВторогоУровня.Сумма / СтрокаВторогоУровня.СуммаВал;
				КонецЕсли;
				
			КонецЦикла; 
			
		КонецЦикла;
		
	КонецЦикла;  
	
	РезультатЗапросаОплаты 	= ПакетРезультатовЗапроса[3]; 
	ВыборкаОплаты = РезультатЗапросаОплаты.Выбрать();
	Пока ВыборкаОплаты.Следующий() Цикл 
		
		ВалютаСчета		= ВыборкаОплаты.Документ.Валюта;
		КурсВалютыСчета	= CW_Финансы.ПолучитьКурсВалюты(ВалютаСчета, ДатаСреза); 
		
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ПредставлениеДокумента", ВыборкаОплаты.Документ.Метаданные()) Тогда
			ПредставлениеДокумента = ВыборкаОплаты.Документ.ПредставлениеДокумента;
		Иначе
			ПредставлениеДокумента = СокрЛП(ВыборкаОплаты.Документ);
		КонецЕсли;   
		
		НоваяСтрокаСчет = ДеревоСчетов.Строки.Добавить();
		НоваяСтрокаСчет.ДокументВзаиморасчетов 	= ВыборкаОплаты.Документ;
		НоваяСтрокаСчет.ПредставлениеДокумента 	= ПредставлениеДокумента;
		НоваяСтрокаСчет.СчетЗадолженности      	= ВыборкаОплаты.СчетЗадолженности;
		НоваяСтрокаСчет.СуммаВал               	= ВыборкаОплаты.Всего;
		//НоваяСтрокаСчет.Сделка                = ВыборкаСчет.Документ.ВедомыйСчет;
		//НоваяСтрокаСчет.СтавкаНДС    			= Неопределено;
		НоваяСтрокаСчет.Сумма 					= CW_Финансы.ПересчитатьИзВалютыВВалюту(
														ВыборкаОплаты.Всего, 
														ВалютаСчета, 
														ВалютаРегламентированногоУчета, 
														КурсВалютыСчета.Курс, 
														КурсВалюты.Курс, 
														КурсВалютыСчета.Кратность, 
														КурсВалюты.Кратность);  
														
		НоваяСтрокаСчет.Курс = 1;
		Если НоваяСтрокаСчет.СуммаВал <> 0 Тогда
			НоваяСтрокаСчет.Курс = НоваяСтрокаСчет.Сумма / НоваяСтрокаСчет.СуммаВал;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ПредставлениеДокумента", ВыборкаОплаты.ДокументБУ.Метаданные()) Тогда
			ПредставлениеДокументаБУ = ВыборкаОплаты.ДокументБУ.ПредставлениеДокумента;
		Иначе
			ПредставлениеДокументаБУ = СокрЛП(ВыборкаОплаты.ДокументБУ);
		КонецЕсли;
		
		СтрокаВторогоУровня = НоваяСтрокаСчет.Строки.Добавить();
		СтрокаВторогоУровня.ИндексКартинки 			= 1;
		СтрокаВторогоУровня.ПредставлениеДокумента 	= ПредставлениеДокументаБУ;
		СтрокаВторогоУровня.ДокументВзаиморасчетов 	= ВыборкаОплаты.ДокументБУ;
		СтрокаВторогоУровня.СчетЗадолженности      	= ВыборкаОплаты.СчетЗадолженности;
		СтрокаВторогоУровня.СуммаВал               	= ВыборкаОплаты.Всего;
		СтрокаВторогоУровня.Сделка                 	= ВыборкаОплаты.ДокументБУ.Основание;
		//СтрокаВторогоУровня.СтавкаНДС    			= Неопределено;
		СтрокаВторогоУровня.Сумма = CW_Финансы.ПересчитатьИзВалютыВВалюту(
										ВыборкаОплаты.Всего, 
										ВалютаСчета, 
										ВалютаРегламентированногоУчета, 
										КурсВалютыСчета.Курс, 
										КурсВалюты.Курс, 
										КурсВалютыСчета.Кратность, 
										КурсВалюты.Кратность);    
										СтрокаВторогоУровня.Курс = 1;
										
		Если СтрокаВторогоУровня.СуммаВал <> 0 Тогда
			СтрокаВторогоУровня.Курс = СтрокаВторогоУровня.Сумма / СтрокаВторогоУровня.СуммаВал;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры
 
&НаСервере
Процедура ПодготовитьДеревоОплатПоРасходамПоГрузоперевозке(Знач РезультатВыбора, ДеревоСчетов, Знач КурсВалюты, Знач ДатаСреза)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОплатаВходящихДокументов.Документ КАК Документ,
	               |	CW_ОплатаВходящихДокументов.ДокументБУ КАК ДокументБУ,
	               |	CW_ОплатаВходящихДокументов.ДокументОплаты КАК ДокументОплаты,
	               |	CW_ОплатаВходящихДокументов.СчетЗадолженности КАК СчетЗадолженности,
	               |	CW_ОплатаВходящихДокументов.Всего КАК Всего,
	               |	CW_ОплатаВходящихДокументов.ПризнакАкта КАК ПризнакАкта
	               |ПОМЕСТИТЬ ВТ_ДанныеРегистра
	               |ИЗ
	               |	РегистрСведений.CW_ОплатаВходящихДокументов КАК CW_ОплатаВходящихДокументов
	               |ГДЕ
	               |	CW_ОплатаВходящихДокументов.Документ В(&РезультатВыбора)
	               |	И CW_ОплатаВходящихДокументов.Регистратор <> &ОплатаСсылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеРегистра.Документ КАК Документ,
	               |	ВТ_ДанныеРегистра.ДокументБУ КАК ДокументБУ,
	               |	ВТ_ДанныеРегистра.ДокументОплаты КАК ДокументОплаты,
	               |	ВТ_ДанныеРегистра.СчетЗадолженности КАК СчетЗадолженности,
	               |	ВТ_ДанныеРегистра.Всего КАК Всего
	               |ПОМЕСТИТЬ ВТ_Акты
	               |ИЗ
	               |	ВТ_ДанныеРегистра КАК ВТ_ДанныеРегистра
	               |ГДЕ
	               |	ВТ_ДанныеРегистра.ПризнакАкта = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Акты.Документ КАК Документ,
	               |	ВТ_Акты.ДокументБУ КАК ДокументБУ,
	               |	ВТ_Акты.ДокументОплаты КАК ДокументОплаты,
	               |	ВТ_Акты.СчетЗадолженности КАК СчетЗадолженности,
	               |	ВТ_Акты.Всего КАК Всего
	               |ИЗ
	               |	ВТ_Акты КАК ВТ_Акты
	               |ИТОГИ
	               |	СУММА(Всего)
	               |ПО
	               |	Документ,
	               |	СчетЗадолженности
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеРегистра.Документ КАК Документ,
	               |	ВТ_ДанныеРегистра.ДокументОплаты КАК ДокументБУ,
	               |	ВТ_ДанныеРегистра.СчетЗадолженности КАК СчетЗадолженности,
	               |	ВТ_ДанныеРегистра.Всего КАК Всего
	               |ИЗ
	               |	ВТ_ДанныеРегистра КАК ВТ_ДанныеРегистра
	               |ГДЕ
	               |	ВТ_ДанныеРегистра.ПризнакАкта = ЛОЖЬ
	               |	И ВТ_ДанныеРегистра.ДокументОплаты ССЫЛКА Документ.CW_Оплата
	               |	И НЕ ВТ_ДанныеРегистра.Документ В
	               |				(ВЫБРАТЬ
	               |					ВТ_Акты.Документ КАК Документ
	               |				ИЗ
	               |					ВТ_Акты КАК ВТ_Акты)";
	
	Запрос.УстановитьПараметр("РезультатВыбора", РезультатВыбора);
	Запрос.УстановитьПараметр("ОплатаСсылка", 	 ОплатаСсылка); 
	
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();  
	
	РезультатЗапроса 		= ПакетРезультатовЗапроса[2];
	
	ВыборкаСчетЗадолженности = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСчетЗадолженности.Следующий() Цикл 
		
		ВыборкаСчет = ВыборкаСчетЗадолженности.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСчет.Следующий() Цикл     
			
			ВалютаСчета		= ВыборкаСчет.Документ.Валюта;
			КурсВалютыСчета	= CW_Финансы.ПолучитьКурсВалюты(ВалютаСчета, ДатаСреза); 
			
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ПредставлениеДокумента", ВыборкаСчет.Документ.Метаданные()) Тогда
				ПредставлениеДокумента = ВыборкаСчет.Документ.ПредставлениеДокумента;
			Иначе
				ПредставлениеДокумента = СокрЛП(ВыборкаСчет.Документ);
			КонецЕсли;
			
			НоваяСтрокаСчет = ДеревоСчетов.Строки.Добавить();
			НоваяСтрокаСчет.ДокументВзаиморасчетов 	= ВыборкаСчет.Документ;
			НоваяСтрокаСчет.ПредставлениеДокумента 	= ПредставлениеДокумента;
			НоваяСтрокаСчет.СчетЗадолженности      	= ВыборкаСчет.СчетЗадолженности;
			НоваяСтрокаСчет.СуммаВал               	= ВыборкаСчет.Всего;
			//НоваяСтрокаСчет.Сделка                = ВыборкаСчет.Документ.ВедомыйСчет;
			//НоваяСтрокаСчет.СтавкаНДС    			= Неопределено;
			НоваяСтрокаСчет.Сумма 					= CW_Финансы.ПересчитатьИзВалютыВВалюту(
														ВыборкаСчет.Всего, 
														ВалютаСчета, 
														ВалютаРегламентированногоУчета, 
														КурсВалютыСчета.Курс, 
														КурсВалюты.Курс, 
														КурсВалютыСчета.Кратность, 
														КурсВалюты.Кратность);  
			
			НоваяСтрокаСчет.Курс = 1;
			Если НоваяСтрокаСчет.СуммаВал <> 0 Тогда
				НоваяСтрокаСчет.Курс = НоваяСтрокаСчет.Сумма / НоваяСтрокаСчет.СуммаВал;
			КонецЕсли;
			
			ВыборкаАкт = ВыборкаСчет.Выбрать();
			Пока ВыборкаАкт.Следующий() Цикл  
				
				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ПредставлениеДокумента", ВыборкаАкт.ДокументБУ.Метаданные()) Тогда
					ПредставлениеДокумента = ВыборкаАкт.ДокументБУ.ПредставлениеДокумента;
				Иначе
					ПредставлениеДокумента = СокрЛП(ВыборкаАкт.ДокументБУ);
				КонецЕсли;
				
				СтрокаВторогоУровня = НоваяСтрокаСчет.Строки.Добавить();
				СтрокаВторогоУровня.ИндексКартинки 			= 1;
				СтрокаВторогоУровня.ПредставлениеДокумента 	= ПредставлениеДокумента;
				СтрокаВторогоУровня.ДокументВзаиморасчетов 	= ВыборкаАкт.ДокументБУ;
				СтрокаВторогоУровня.СчетЗадолженности      	= ВыборкаАкт.СчетЗадолженности;
				СтрокаВторогоУровня.СуммаВал               	= ВыборкаАкт.Всего;
				СтрокаВторогоУровня.Сделка                 	= ВыборкаАкт.ДокументБУ.ВедомыйДокумент;
				//СтрокаВторогоУровня.СтавкаНДС    			= Неопределено;
				СтрокаВторогоУровня.Сумма = CW_Финансы.ПересчитатьИзВалютыВВалюту(
												ВыборкаАкт.Всего, 
												ВалютаСчета, 
												ВалютаРегламентированногоУчета, 
												КурсВалютыСчета.Курс, 
												КурсВалюты.Курс, 
												КурсВалютыСчета.Кратность, 
												КурсВалюты.Кратность);    
				
				СтрокаВторогоУровня.Курс = 1;
				Если СтрокаВторогоУровня.СуммаВал <> 0 Тогда
					СтрокаВторогоУровня.Курс = СтрокаВторогоУровня.Сумма / СтрокаВторогоУровня.СуммаВал;
				КонецЕсли;
				
			КонецЦикла; 
			
		КонецЦикла;
		
	КонецЦикла;  
	
	РезультатЗапросаОплаты 	= ПакетРезультатовЗапроса[3]; 
	ВыборкаОплаты = РезультатЗапросаОплаты.Выбрать();
	Пока ВыборкаОплаты.Следующий() Цикл 
		
		ВалютаСчета		= ВыборкаОплаты.Документ.Валюта;
		КурсВалютыСчета	= CW_Финансы.ПолучитьКурсВалюты(ВалютаСчета, ДатаСреза); 
		
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ПредставлениеДокумента", ВыборкаОплаты.Документ.Метаданные()) Тогда
			ПредставлениеДокумента = ВыборкаОплаты.Документ.ПредставлениеДокумента;
		Иначе
			ПредставлениеДокумента = СокрЛП(ВыборкаОплаты.Документ);
		КонецЕсли;   
		
		НоваяСтрокаСчет = ДеревоСчетов.Строки.Добавить();
		НоваяСтрокаСчет.ДокументВзаиморасчетов 	= ВыборкаОплаты.Документ;
		НоваяСтрокаСчет.ПредставлениеДокумента 	= ПредставлениеДокумента;
		НоваяСтрокаСчет.СчетЗадолженности      	= ВыборкаОплаты.СчетЗадолженности;
		НоваяСтрокаСчет.СуммаВал               	= ВыборкаОплаты.Всего;
		//НоваяСтрокаСчет.Сделка                = ВыборкаСчет.Документ.ВедомыйСчет;
		//НоваяСтрокаСчет.СтавкаНДС    			= Неопределено;
		НоваяСтрокаСчет.Сумма 					= CW_Финансы.ПересчитатьИзВалютыВВалюту(
														ВыборкаОплаты.Всего, 
														ВалютаСчета, 
														ВалютаРегламентированногоУчета, 
														КурсВалютыСчета.Курс, 
														КурсВалюты.Курс, 
														КурсВалютыСчета.Кратность, 
														КурсВалюты.Кратность);  
														
		НоваяСтрокаСчет.Курс = 1;
		Если НоваяСтрокаСчет.СуммаВал <> 0 Тогда
			НоваяСтрокаСчет.Курс = НоваяСтрокаСчет.Сумма / НоваяСтрокаСчет.СуммаВал;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ПредставлениеДокумента", ВыборкаОплаты.ДокументБУ.Метаданные()) Тогда
			ПредставлениеДокументаБУ = ВыборкаОплаты.ДокументБУ.ПредставлениеДокумента;
		Иначе
			ПредставлениеДокументаБУ = СокрЛП(ВыборкаОплаты.ДокументБУ);
		КонецЕсли;
		
		СтрокаВторогоУровня = НоваяСтрокаСчет.Строки.Добавить();
		СтрокаВторогоУровня.ИндексКартинки 			= 1;
		СтрокаВторогоУровня.ПредставлениеДокумента 	= ПредставлениеДокументаБУ;
		СтрокаВторогоУровня.ДокументВзаиморасчетов 	= ВыборкаОплаты.ДокументБУ;
		СтрокаВторогоУровня.СчетЗадолженности      	= ВыборкаОплаты.СчетЗадолженности;
		СтрокаВторогоУровня.СуммаВал               	= ВыборкаОплаты.Всего;
		СтрокаВторогоУровня.Сделка                 	= ВыборкаОплаты.ДокументБУ.Основание;
		//СтрокаВторогоУровня.СтавкаНДС    			= Неопределено;
		СтрокаВторогоУровня.Сумма = CW_Финансы.ПересчитатьИзВалютыВВалюту(
										ВыборкаОплаты.Всего, 
										ВалютаСчета, 
										ВалютаРегламентированногоУчета, 
										КурсВалютыСчета.Курс, 
										КурсВалюты.Курс, 
										КурсВалютыСчета.Кратность, 
										КурсВалюты.Кратность);    
										СтрокаВторогоУровня.Курс = 1;
										
		Если СтрокаВторогоУровня.СуммаВал <> 0 Тогда
			СтрокаВторогоУровня.Курс = СтрокаВторогоУровня.Сумма / СтрокаВторогоУровня.СуммаВал;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры


&НаСервере
Функция ПолучитьПустоеДерево()  
	
	ДеревоСчетов = РеквизитФормыВЗначение("ДеревоЗначений");
	ДеревоСчетов.Строки.Очистить();
	
	Возврат ДеревоСчетов;
	
КонецФункции
//---Подбор документов


&НаКлиенте
Процедура ПеренестиВДокумент(Команда) 
	
	РезультатВыполнения =  НачатьЗаполнениеДокументовНаСервереВФоне();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьЗаполненияДокументов", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры   

&НаКлиенте
Процедура ОбработатьЗаполненияДокументов(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ЭтаФорма.Закрыть(Истина);
	
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		
		ТекстПредупреждения = "Не удалось сформировать документы!
		| По причине: "+ РезультатВыполнения.КраткоеПредставлениеОшибки + "
		| Информаиция об ошибке см. в журнале регистрации!";
		
		Если ТипЗнч(РезультатВыполнения.Сообщения) = Тип("Массив") Тогда
			Для Каждого СообщениеВМассиве из РезультатВыполнения.Сообщения Цикл
				СообщениеВМассиве.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Ошибка формирования документов"); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НачатьЗаполнениеДокументовНаСервереВФоне() 
	
	ДокументОплата 				= ПолучитьСвязанныйДокументОплата();
	СтруктураТаблицДокументов 	= ПодготовитьПустыеТаблицыДокументов(); 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДатаДокумента", 					ДатаДокумента);
	СтруктураПараметров.Вставить("Организация", 					Организация);
	СтруктураПараметров.Вставить("Контрагент", 						Контрагент);
	СтруктураПараметров.Вставить("Договор", 						Договор);
	СтруктураПараметров.Вставить("ПриложениеКДоговору",				ПриложениеКДоговору);
	СтруктураПараметров.Вставить("УчетныйДоговор",					УчетныйДоговор);
	СтруктураПараметров.Вставить("СтатьяДвиженияДенежныхСредств",	СтатьяДвиженияДенежныхСредств);
	СтруктураПараметров.Вставить("ДереваСчетов", 					РеквизитФормыВЗначение("ДеревоЗначений"));
	СтруктураПараметров.Вставить("ДокументВыписки",					ДокументВыписки);
	СтруктураПараметров.Вставить("ДокументОплата",					ДокументОплата);
	СтруктураПараметров.Вставить("ПустыеТаблицыДокументов",			СтруктураТаблицДокументов); 

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Заполнение документ ""Списание с расчетного счета""";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.CW_ПодборОперативныхДокументов.ЗаполнитьДокументСписаниеСРасчетногоСчета", СтруктураПараметров, ПараметрыВыполнения);
	
КонецФункции

&НаСервере
Функция ПолучитьСвязанныйДокументОплата()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_СвязанныеОплаты.Ссылка КАК Ссылка
	|ИЗ
	|	КритерийОтбора.CW_СвязанныеОплаты(&СписаниеСРасчетногоСчета) КАК CW_СвязанныеОплаты";   
	
	Запрос.УстановитьПараметр("СписаниеСРасчетногоСчета", ДокументВыписки);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОплата = Выборка.Ссылка;
	КонецЕсли;

	Возврат ДокументОплата;

КонецФункции

&НаСервере
Функция ПодготовитьПустыеТаблицыДокументов()

	СтруктураТаблиц = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 0
	|	CW_ОплатаОплата.Счет КАК Счет,
	|	CW_ОплатаОплата.Акт КАК Акт,
	|	CW_ОплатаОплата.СчетЗадолженности КАК СчетЗадолженности,
	|	CW_ОплатаОплата.СчетАванса КАК СчетАванса,
	|	CW_ОплатаОплата.Оплата КАК Оплата,
	|	CW_ОплатаОплата.Оплата_БВ КАК Оплата_БВ,
	|	CW_ОплатаОплата.Курс КАК Курс,
	|	CW_ОплатаОплата.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	Документ.CW_Оплата.Оплата КАК CW_ОплатаОплата";  
	
	РезультатЗапроса 	= Запрос.Выполнить();
	ТаблицаОплат 		= РезультатЗапроса.Выгрузить();
	
	СтруктураТаблиц.Вставить("Оплаты", ТаблицаОплат);
	
	Если ТипЗнч(ДокументВыписки) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 0
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.Сделка КАК Сделка,
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.СуммаПлатежа КАК СуммаПлатежа,
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.СтавкаНДС КАК СтавкаНДС,
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.СуммаНДС КАК СуммаНДС,
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.СчетУчетаРасчетовСКонтрагентом КАК СчетУчетаРасчетовСКонтрагентом,
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.СчетУчетаРасчетовПоАвансам КАК СчетУчетаРасчетовПоАвансам,
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.РасходыУСН КАК РасходыУСН,
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.НДСУСН КАК НДСУСН,
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.УдалитьРаспределятьРасходыУСН КАК УдалитьРаспределятьРасходыУСН,
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.СчетНаОплату КАК СчетНаОплату,
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.ВидПлатежаПоКредитамЗаймам КАК ВидПлатежаПоКредитамЗаймам,
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.ПорядокОтраженияДохода КАК ПорядокОтраженияДохода,
		|	СписаниеСРасчетногоСчетаРасшифровкаПлатежа.ОтражениеВУСН КАК ОтражениеВУСН
		|ИЗ
		|	Документ.СписаниеСРасчетногоСчета.РасшифровкаПлатежа КАК СписаниеСРасчетногоСчетаРасшифровкаПлатежа";  
		
		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаСписаниеСРасчетногоСчета = РезультатЗапроса.Выгрузить(); 
		
		СтруктураТаблиц.Вставить("ТаблицаБухгалтескогоДокумента", 	ТаблицаСписаниеСРасчетногоСчета);
	
	КонецЕсли;
	
	Если ТипЗнч(ДокументВыписки) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 0
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.Сделка КАК Сделка,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаПлатежа КАК СуммаПлатежа,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СтавкаНДС КАК СтавкаНДС,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаНДС КАК СуммаНДС,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СчетНаОплату КАК СчетНаОплату,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СчетУчетаРасчетовСКонтрагентом КАК СчетУчетаРасчетовСКонтрагентом,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СчетУчетаРасчетовПоАвансам КАК СчетУчетаРасчетовПоАвансам,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СубконтоКт1 КАК СубконтоКт1,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СубконтоКт2 КАК СубконтоКт2,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СубконтоКт3 КАК СубконтоКт3,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.ПодразделениеКт КАК ПодразделениеКт,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаУслуг КАК СуммаУслуг,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.КурсНаДатуПриобретенияРеализацииВалюты КАК КурсНаДатуПриобретенияРеализацииВалюты,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.ПорядокОтраженияАванса КАК ПорядокОтраженияАванса,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.ДоходыУСН КАК ДоходыУСН,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.УслугаНПД КАК УслугаНПД,
		|	ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа.СуммаВозврата КАК СуммаВозврата
		|ИЗ
		|	Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК ПоступлениеНаРасчетныйСчетРасшифровкаПлатежа";  
		
		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаПоступлениеНаРасчетныйСчет = РезультатЗапроса.Выгрузить();
		
		СтруктураТаблиц.Вставить("ТаблицаБухгалтескогоДокумента", 	ТаблицаПоступлениеНаРасчетныйСчет);
	КонецЕсли;
	
	Возврат СтруктураТаблиц;
	
КонецФункции

&НаКлиенте
Процедура ДеревоЗначенийСуммаВалПриИзменении(Элемент) 
	
	ТекущиеДанные = Элементы.ДеревоЗначений.ТекущиеДанные;
	Если ВалютаДоговора = ВалютаРегламентированногоУчета Тогда
		ТекущиеДанные.Сумма = ТекущиеДанные.СуммаВал;  
	Иначе
		ТекущиеДанные.Сумма  = ПересчитатьСуммуНаСервере(ТекущиеДанные.СуммаВал, ВалютаДоговора, ВалютаРегламентированногоУчета); 
	КонецЕсли;

	ТекущиеДанные.Курс = 1;
	Если ТекущиеДанные.СуммаВал <> 0 Тогда
		ТекущиеДанные.Курс = ТекущиеДанные.Сумма / ТекущиеДанные.СуммаВал;
	КонецЕсли;
	
   	ПересчитатьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗначенийСуммаПриИзменении(Элемент)   
	
	ТекущиеДанные = Элементы.ДеревоЗначений.ТекущиеДанные;
	Если ВалютаДоговора = ВалютаРегламентированногоУчета Тогда
		ТекущиеДанные.СуммаВал = ТекущиеДанные.Сумма; 
	Иначе
		//ТекущиеДанные.СуммаВал = ПересчитатьСуммуНаСервере(ТекущиеДанные.Сумма, ВалютаРегламентированногоУчета, ВалютаДоговора); 
	КонецЕсли;
	
	ТекущиеДанные.Курс = 1;
	Если ТекущиеДанные.СуммаВал <> 0 Тогда
		ТекущиеДанные.Курс = ТекущиеДанные.Сумма / ТекущиеДанные.СуммаВал;
	КонецЕсли;

   	ПересчитатьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗначенийПослеУдаления(Элемент)
   	ПересчитатьИтоги();
КонецПроцедуры

&НаСервере
Функция ПересчитатьСуммуНаСервере(Сумма, ВалютаНач, ВалютаКон)
	
	КурсВалютыНач = CW_Финансы.ПолучитьКурсВалюты(ВалютаНач, ДатаДокумента);
	КурсВалютыКон = CW_Финансы.ПолучитьКурсВалюты(ВалютаКон, ДатаДокумента);
	
	Возврат CW_Финансы.ПересчитатьИзВалютыВВалюту(Сумма, ВалютаНач,ВалютаКон,КурсВалютыНач.Курс, КурсВалютыКон.Курс, КурсВалютыНач.Курс, КурсВалютыНач.Кратность); 
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьИтоги()
	
	ИтогоСуммаВал = 0;
	ЭлементыДерева = ДеревоЗначений.ПолучитьЭлементы();
	Для Каждого ЭлементДерева из ЭлементыДерева Цикл 
		ДанныеСтроки = ПолучитьДанныеСтроки(ЭлементДерева);
		ЭлементДерева.СуммаВал = ДанныеСтроки.СуммаВал;
		ЭлементДерева.Сумма    = ДанныеСтроки.Сумма;   
		
		ЭлементДерева.Курс = 1;
		Если ЭлементДерева.СуммаВал <> 0 Тогда
			ЭлементДерева.Курс = ЭлементДерева.Сумма / ЭлементДерева.СуммаВал;
		КонецЕсли;
		
		ИтогоСуммаВал = ИтогоСуммаВал + ДанныеСтроки.СуммаВал
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Функция ПолучитьДанныеСтроки(ЭлементДерева)   
	
	ДанныеСтроки = Новый Структура("СуммаВал,Сумма", 0,0);
	
	ЭлементыДерева = ЭлементДерева.ПолучитьЭлементы();
	Для Каждого СтрокаДерева из ЭлементыДерева Цикл
		 ДанныеСтроки.Сумма 	= СтрокаДерева.Сумма;
		 ДанныеСтроки.СуммаВал 	= СтрокаДерева.СуммаВал;
	КонецЦикла;
	
	Возврат ДанныеСтроки;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьДокументВзаиморасчетов(Команда)
	
	ТекущаяСтрока = Элементы.ДеревоЗначений.ТекущаяСтрока;
	ПродолжитьОткрытиеДокумента(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЗначенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ДеревоЗначенийПредставлениеДокумента" Тогда
		СтандартнаяОбработка = Ложь;
		ПродолжитьОткрытиеДокумента(ВыбраннаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОткрытиеДокумента(ВыбраннаяСтрока)
	
	СтрокаТекущая = ДеревоЗначений.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ПоказатьЗначение(, СтрокаТекущая.ДокументВзаиморасчетов);
	
КонецПроцедуры
